document.addEventListener("DOMContentLoaded", function () {
  const dataSelect = {
    "1": {
      area: "Амурский м.р-н",
      locality: [
        "г. Амурск",
        "п.ст. 147 км",
        "18 рзд",
        "21 рзд",
        "с. Ачан",
        "с. Болонь",
        "п.ст. Вадан",
        "с. Вознесенское",
        "с. Голубичное",
        "п.ст. Джармен",
        "п.ст. Джелюмкен",
        "с. Джуен",
        "с. Диппы",
        "п. Известковый",
        "нп Казарма 207 км",
        "п.ст. казарма 213 км",
        "п.ст. Казарма 286 км",
        "п.ст. Казарма 37 км",
        "п.ст. Казарма 51 км",
        "п.ст. Казарма 59 км",
        "п. Лесной",
        "п. Литовко",
        "п.ст. Малмыж",
        "ст. Менгон",
        "п.ст. Нусхи",
        "с. Омми",
        "с. Падали",
        "п.ст. Партизанские Сопки",
        "с. Рыббаза",
        "п. Санболи",
        "п.ст. Сельгон",
        "п.ст. Тейсин",
        "с. Украинка",
        "с. Ульбинка",
        "с. Усть-Гур",
        "п.ст. Форель",
        "ж/д рзд Хевчен",
        "рп Эльбан",
      ],
      school: [
        "МБОУ СОШ №2 г. Амурска",
        "МБОУ СОШ №3 г. Амурска",
        "МБОУ СОШ №5 г. Амурска",
        "МБОУ СОШ №6 г. Амурска",
        "МБОУ НОШ №7 г. Амурска",
        "МБОУ СОШ №9 г. Амурска",
        "МБОУ СОШ №3 п. Эльбан",
        "МБОУ НОШ №1 п. Эльбан",
        "МБОУ СОШ п. Литовко",
        "МБОУ СОШ с. Вознесенское",
        "МБОУ СОШ п. Известковый",
        "МБОУ СОШ п. Санболи",
        "МБОУ СОШ п. Лесной",
        "МБОУ СОШ п. Тейсин",
        "МБОУ СОШ с. Болонь",
        "МБОУ СОШ с. Ачан",
        "МБОУ ООШ с. Омми",
        "МБОУ ООШ с. Джуен",
      ],
    },
    "2": {
      area: "Аяно-Майский м.р-н",
      locality: [
        "с. Аим",
        "с. Аян",
        "нп База Налбандя",
        "с. Джигда",
        "нп Батомга",
        "нп Курун-Урях",
        "нп Аимчан",
        "нп Назарово",
        "нп Разрезной",
        "нп Семиречье",
        "нп Цыпанда",
        "с. Нелькан",
        "с. Федорово",
      ],
      school: [
        "МКОУ НОШ с. Аим",
        "МКОУ ООШ с. Джигда",
        "МКОУ СОШ с. Аян",
        "МКОУ СОШ с. Нелькан",
      ],
    },
    "3": {
      area: "Бикинский м.р-н",
      locality: [
        "г. Бикин",
        "п. Бойцово",
        "с. Васильевка",
        "с. Добролюбово",
        "с. Лермонтовка",
        "с. Лесопильное",
        "с. Лончаково",
        "с. Оренбургское",
        "п.ст. Перелесок",
        "с. Покровка",
        "п.ст. Розенгартовка",
        "с. Пушкино",
      ],
      school: [
        "МБОУ НШ ДС с. Пушкино",
        "МБОУ ООШ с. Лесопильное",
        "МБОУ ООШ с. Оренбургское",
        "МБОУ СОШ с. Лермонтовка",
        "МБОУ СОШ с. Лончаково",
        "МБОУ ООШ №3 г. Бикина",
        "МБОУ ООШ №5 г. Бикина",
        "МБОУ СОШ №6 г. Бикина",
        "МБОУ НОШ №23 г. Бикина",
        "МБОУ ООШ №53 г. Бикина",
      ],
    },
    "4": {
      area: "Ванинский м.р-н",
      locality: [
        "рп Ванино",
        "рп Высокогорный",
        "с. Датта",
        "с. Дюанка",
        "п. Токи",
        "п. Монгохто",
        "п. Кенада",
        "рп Октябрьский",
        "с. Уська-Орочская",
        "п. Тумнин",
        "п. Тулучи",
        "п. Токи",
        "п. Акур",
        "п.ст. Датта",
        "п. Акурский совхоз 38",
        "п.ст. Косграмбо",
        "п.ст. Кото",
        "п.ст. Кузнецовский",
        "п. Откосная",
        "п.ст. Оунэ",
        "с. Хуту",
        "п. Чепсары",
        "с. Чипсари",
      ],
      school: [
        "МБОУ СОШ п. Октябрьский",
        "МБОУ ООШ с. Датта",
        "МБОУ СОШ п. Высокогорный",
        "МБОУ СОШ п. Токи",
        "МБОУ СОШ п. Тумнин",
        "МБОУ СОШ с. Кенада",
        "МБОУ СОШ с. Тулучи",
        "МБОУ СОШ с. Уська-Орочская",
        "МБОУ СОШ п. Монгохто",
        "МБОУ В(с)ОШ №1 п. Ванино",
        "МБОУ СОШ №2 п. Ванино",
        "МБОУ СОШ №3 п. Ванино",
        "МБОУ СОШ №4 п. Ванино",
      ],
    },
    "5": {
      area: "Верхнебуреинский м.р-н",
      locality: [
        "рзд Адникан",
        "с. Аланап",
        "п. Алонка",
        "нп Амурская",
        "п. Веселый",
        "п. Герби",
        "п.ст. Зимовье",
        "п. Казарма 142 км",
        "п. Лиственный",
        "п.ст. Мошка",
        "рп Новый Ургал",
        "с. Согда",
        "п. Солони",
        "п. Софийск",
        "с. Средний Ургал",
        "с. Стройучасток",
        "п. Сулук",
        "п.ст. Таланджа",
        "п.ст. Таракелок",
        "п. Тырма",
        "п. Ургал",
        "с. Усть-Умальта",
        "с. Усть-Ургал",
        "п.ст. Ушман",
        "п. ЦЭС",
        "рп Чегдомын",
        "с. Чекунда",
        "п. Шахтинский",
        "п.ст. Эльга",
        "п. Этыркен",
        "п.ст. Эхилкан",
        "п.ст. Ягдынья",
      ],
      school: [
        "МБОУ Многопрофильный лицей рп. Чегдомын",
        "МБОУ СОШ №2 рп. Чегдомын",
        "МБОУ ООШ №5 рп. Чегдомын",
        "МБОУ Гимназия рп. Чегдомын",
        "МБОУ ООШ №9 п. Софийск",
        "МБОУ СОШ №10 рп. Чегдомын",
        "МБОУ СОШ №11 п. Новый Ургал",
        "МБОУ ООШ №12 с. Согда",
        "МБОУ ООШ №14 с. Чекунда",
        "МБОУ ООШ №15 ст. Зимовье",
        "МБОУ ООШ №16 с. Аланап",
        "МБОУ СОШ №17 п. Тырма",
        "МБОУ ООШ №17 п. Солони",
        "МБОУ СОШ №19 п. Алонка",
        "МБОУ СОШ №20 п. Сулук",
        "МБОУ ООШ №21 п. Герби",
        "МБОУ СОШ №22 п. Этыркен",
      ],
    },
    "6": {
      area: "Вяземский м.р-н",
      locality: [
        "г. Вяземский",
        "с. Аван",
        "с. Венюково",
        "с. Видное",
        "с. Виноградовка",
        "п.ст. Гедике",
        "с. Глебово",
        "с. Дормидонтовка",
        "с. Забайкальское",
        "п.ст. Каменушка",
        "с. Капитоновка",
        "с. Кедрово",
        "с. Котиково",
        "с. Красицкое",
        "с. Кукелево",
        "п. Медвежий",
        "с. Отрадное",
        "с. Роскошь",
        "с. Садовое",
        "с.пт. Снарский",
        "с. Шереметьево",
        "п. Шумный",
        "ст. Щебенчиха",
      ],
      school: [
        "МБОУ ООШ с. Котиково",
        "МБОУ ООШ с. Красицкое",
        "МБОУ ООШ с. Глебово",
        "МБОУ ООШ с. Дормидонтовка",
        "МБОУ ООШ с. Капитоновка",
        "МБОУ ООШ с. Отрадное",
        "МБОУ СОШ с. Аван",
        "МБОУ СОШ с. Шереметьево",
        "МБОУ СОШ №1 г. Вяземского",
        "МБОУ СОШ п. Дормидонтовка",
        "МБОУ СОШ №2 г. Вяземского",
        "МБОУ ООШ №3 г. Вяземского",
        "МБОУ СОШ №20 г. Вяземского",
      ],
    },
    "7": {
      area: "Комсомольский м.р-н",
      locality: [
        "п. Аксиян",
        "с. Бельго",
        "с. Бичи",
        "с. Боктор",
        "с. Большая Картель",
        "с. Верхнетамбовское",
        "с. Верхняя Эконь",
        "с. Гайтер",
        "п.ст. Гайтер",
        "п. Галичный",
        "п. Гурское",
        "с. Даппы",
        "п. Кенай",
        "ст. Кун",
        "п. Мачтовый",
        "п. Молодежный",
        "с. Нижнетамбовское",
        "с. Нижние Халбы",
        "с. Новоильиновка",
        "с. Новый Мир",
        "п. Октябрьский",
        "с. Онды",
        "с. Пивань",
        "п.ст. Пони",
        "п.ст. Почепта",
        "нп Разъезд 105 км",
        "с. Селихино",
        "п. Снежный",
        "с. Среднетамбовское",
        "с. Станок",
        "ст. Удоми",
        "п. Уктур",
        "с. Хурба",
        "с. Черный Мыс",
        "нп Шарголь урочище",
        "с. Шелехово",
        "п.ст. Эльдиган",
        "с. Эммер",
        "п. Ягодный",
      ],
      school: [
        "МБОУ ООШ с. Бельго",
        "МБОУ ООШ с. Боктор",
        "МБОУ ООШ с. Даппы",
        "МБОУ ООШ п. Галичный",
        "МБОУ СОШ п. Кенай",
        "МБОУ СОШ п. Молодежный",
        "МБОУ СОШ п. Снежный",
        "МБОУ СОШ п. Ягодный",
        "МБОУ СОШ с. Большая Картель",
        "МБОУ СОШ с. Гайтер",
        "МБОУ СОШ п. Гурское",
        "МБОУ СОШ с. Нижнетамбовское",
        "МБОУ СОШ с. Нижние Халбы",
        "МКОУ СОШ с. Новый Мир",
        "МБОУ СОШ с. Селихино",
        "МБОУ СОШ п. Уктур",
        "МБОУ ООШ с. Верхняя Эконь",
        "МБОУ СОШ №1 с. Пивань",
        "МБОУ СОШ №1 с. Хурба",
        "МБОУ СОШ №2 с. Пивань",
        "МБОУ СОШ №2 с. Хурба",
      ],
    },
    "8": {
      area: "Нанайский м.р-н",
      locality: [
        "с. Арсеньево",
        "с. Верхний Нерген",
        "с. Верхняя Манома",
        "с. Гасси",
        "с. Дада",
        "с. Даерга",
        "с. Джари",
        "п. Джонка",
        "с. Дубовый Мыс",
        "с. Иннокентьевка",
        "с. Искра",
        "с. Лидога",
        "с. Малмыж",
        "с. Маяк",
        "с. Найхин",
        "с. Нижняя Манома",
        "п. Синда",
        "с. Славянка",
        "с. Троицкое",
        "с. Уни",
      ],
      school: [
        "МБОУ НОШ с. Даерга",
        "МБОУ ООШ с. Арсеньево",
        "МБОУ ООШ с. Верхний Нерген",
        "МБОУ ООШ с. Дада",
        "МБОУ ООШ с. Иннокентьевка",
        "МБОУ ООШ п. Синда",
        "МБОУ СОШ п. Джонка",
        "МБОУ СОШ с. Дубовый Мыс",
        "МБОУ СОШ с. Лидога",
        "МБОУ СОШ с. Маяк",
        "МБОУ СОШ с. Найхин",
        "филиал МБОУ СОШ с. Лидога",
        "МБОУ СОШ №1 с. Троицкое",
        "МБОУ НОШ №3 с. Троицкое",
      ],
    },
    "9": {
      area: "Николаевский м.р-н",
      locality: [
        "г. Николаевск-на-Амуре",
        "с. Алеевка",
        "с. Алексеевка",
        "с. Байдуково",
        "с. Виданово",
        "с. Власьево",
        "с. Гырман",
        "с. Джаорэ",
        "с. Иннокентьевка",
        "с. Константиновка",
        "с. Красное",
        "рп Лазарев",
        "с. Литке",
        "п. Маго",
        "с. Макаровка",
        "рп Многовершинный",
        "с. Нигирь",
        "п. Нижнее Пронге",
        "п. Озерпах",
        "с. Орель-Чля",
        "с. Оремиф",
        "с. Подгорное",
        "с. Половинка",
        "п. Пуир",
        "с. Сахаровка",
        "с. Свободное",
        "с. Тнейвах",
        "с. Чля",
        "п. Чныррах",
      ],
      school: [
        "МБОУ НШ ДС п. Озерпах",
        "МБОУ ООШ п. Нижнее Пронге",
        "МБОУ ООШ п. Пуир",
        "МБОУ ООШ с. Нигирь",
        "МБОУ ООШ с. Оремиф",
        "МБОУ СОШ рп Лазарев",
        "МБОУ СОШ рп Многовершинный",
        "МБОУ СОШ с. Иннокентьевка",
        "МБОУ СОШ с. Константиновка",
        "МОУ СОШ с. Красное",
        "МБОУ ООШ с. Чля",
        "МБОУ СОШ №1 г. Николаевска-на-Амуре",
        "МБОУ СОШ №2 г. Николаевска-на-Амуре",
        "МБОУ СОШ №4 г. Николаевска-на-Амуре",
        "МБОУ СОШ №5 г. Николаевска-на-Амуре",
        "МБОУ СОШ №5 п. Маго",
      ],
    },
    "10": {
      area: "Охотский м.р-н",
      locality: [
        "рп Охотск",
        "с. Арка",
        "п. Аэропорт",
        "с. Булгин",
        "с. Вострецово",
        "с. Иня",
        "с. Кетанда",
        "п. Морской",
        "п. Новая Земля",
        "п. Новая Иня",
        "п. Новое Устье",
        "с. Нядбаки",
        "п. Островной",
        "с. Резиденция",
        "п. Улья",
        "п. Усчан",
      ],
      school: [
        "МКОУ В(С)Ш рп Охотск",
        "МКОУ НШ ДС с. Иня",
        "МКОУ ООШ п. Новое Устье",
        "МКОУ СОШ п. Новая Иня",
        "МКОУ СОШ с. Арка",
        "МКОУ СОШ с. Булгин",
        "МКОУ СОШ №1 рп Охотск",
        "МКОУ СОШ с. Вострецово",
      ],
    },
    "11": {
      area: "м.р-н им.Лазо",
      locality: [
        "п. 34 км",
        "п. 43 км",
        "п. 52 км",
        "п. 53 км",
        "с. Аргунское",
        "п. База Дрофа",
        "с. Бичевая",
        "с. Васильевка",
        "с. Владимировка",
        "с. Второй Сплавной Участок",
        "с. Гвасюги",
        "с. Георгиевка",
        "с. Гродеково",
        "с. Дальневосточное",
        "п. Долми",
        "с. Дрофа",
        "п. Дурмин",
        "с. Екатеринославка",
        "п. Змейка",
        "с. Зоевка",
        "п. Золотой",
        "с. Каменец-Подольск",
        "п. Катэн",
        "с. Киинск",
        "п. Кия",
        "с. Кондратьевка",
        "с. Кругликово",
        "п.ст. Кругликово",
        "п. Кутузовка",
        "с. Марусино",
        "с. Могилевка",
        "рп Мухен",
        "с. Невельское",
        "п. Новостройка",
        "п. Обор",
        "с. Павленково",
        "рп Переяславка",
        "Переяславка Вторая Городок",
        "с. Петровичи",
        "с. Полетное",
        "с. Прудки",
        "с. Святогорье",
        "п. Сидима",
        "п. Сита",
        "с. Соколовка",
        "п. Солонцовый",
        "п. Среднехорский",
        "п. Сукпай",
        "п. Третий сплавной участок",
        "с. Хака",
        "рп Хор",
        "с. Черняево",
        "с. Шаповаловка",
        "п. Южный",
      ],
      school: [
        "МБОУ НОШ рп Переяславка",
        "МБОУ НОШ с. Екатеринославка",
        "МБОУ НОШ с. Киинск",
        "МБОУ ООШ п. Долми",
        "МБОУ ООШ п. Солонцовый",
        "МБОУ ООШ п. Среднехорский",
        "МБОУ ООШ с. Гродеково",
        "МБОУ СОШ п. Дурмин",
        "МБОУ СОШ п. Золотой",
        "МБОУ СОШ рп Мухен",
        "МБОУ СОШ им. А.В. Суворова п. Новостройка",
        "МБОУ СОШ п. Обор им. Е.А. Дикопольцева",
        "МБОУ СОШ п. Сидима",
        "МБОУ СОШ п. Сита",
        "МБОУ СОШ п. Сукпай",
        "МБОУ СОШ с. Бичевая",
        "МБОУ СОШ с. Гвасюги",
        "МБОУ СОШ с. Георгиевка",
        "МБОУ СОШ с. Кругликово",
        "МБОУ СОШ с. Могилёвка",
        "МБОУ СОШ с. Полётное",
        "МБОУ СОШ с. Святогорье",
        "МБОУ СОШ с. Соколовка",
        "МБОУ СОШ с. Черняево",
        "МБОУ СОШ №1 рп Хор",
        "МБОУ СОШ №1 рп Переяславка",
        "МБОУ СОШ №2 рп Хор",
        "МБОУ СОШ №2 рп Переяславка",
        "МБОУ СОШ №3 рп Хор",
      ],
    },
    "12": {
      area: "м.р-н им.Полины Осипенко",
      locality: [
        "с. Бриакан",
        "с. Веселая Горка",
        "с. Владимировка",
        "нп Каменка",
        "нп Упагда",
        "нп Тимченко",
        "с. Главный Стан",
        "с. Гуга",
        "с. им П.Осипенко",
        "с. Князево",
        "нп Ниланкан",
        "нп Обхорощее",
        "с. Оглонги",
        "п. Октябрьский",
        "с. Удинск",
        "п. Херпучи",
      ],
      school: [
        "МБОУ НОШ с. Владимировка",
        "МБОУ СОШ с. Бриакан",
        "МБОУ СОШ с. им. П. Осипенко",
        "МБОУ СОШ п. Херпучи",
      ],
    },
    "13": {
      area: "Советско-Гаванский м.р-н",
      locality: [
        "г. Советская Гавань",
        "п. Гатка",
        "с. Гроссевичи",
        "рп Заветы Ильича",
        "п. Иннокентъевский",
        "п. Коппи",
        "рп Лососина",
        "рп Майский",
        "п. Нельма",
      ],
      school: [
        "МБОУ СШ №1 г. Советская Гавань",
        "МБОУ СШ №2 г. Советская Гавань",
        "МБОУ СШ № 3 им. А.И.Томилина г. Советская Гавань",
        "МБОУ СШ №5 г. Советская Гавань",
        "МБОУ СШ №6 рп Лососина",
        "МБОУ СШ №8 г. Советская Гавань",
        "МБОУ ОШ №12 п. Гатка",
        "МБОУ ОШ №14 рп Майский",
        "МБОУ ОШ №15 рп Майский",
        "Средняя школа №16 рп Заветы Ильича",
        "МКОУ ВШ №2 г. Советская Гавань",
      ],
    },
    "14": {
      area: "Солнечный м.р-н",
      locality: [
        "п. Амгунь",
        "п. Березовый",
        "с. Болен",
        "п. Горин",
        "п. Горный",
        "п. Джамку",
        "п. Домостроительный Завод",
        "п. Дуки",
        "с. Кондон",
        "п. Лиан",
        "с. Мавринск",
        "рп Солнечный",
        "с. Тавлинка",
        "п. Хальгасо",
        "п. Харпичан",
        "п. Хурмули",
        "с. Эворон",
      ],
      school: [
        "МБОУ ООШ п. Амгунь",
        "МБОУ СОШ п. Березовый",
        "МБОУ СОШ п. Горин",
        "МБОУ СОШ п. Горный",
        "МБОУ СОШ п. Джамку",
        "МБОУ СОШ п. Дуки",
        "МБОУ СОШ п. Харпичан",
        "МБОУ СОШ п. Хурмули",
        "МБОУ СОШ с. Кондон",
        "МБОУ СОШ с. Эворон",
        "МБОУ СОШ №1 рп Солнечный",
        "МБОУ СОШ №2 рп Солнечный",
        "МБОУ СОШ №3 рп Солнечный",
      ],
    },
    "15": {
      area: "Тугуро-Чумиканский м.р-н",
      locality: [
        "с. Алгазея",
        "нп Большой Шантар",
        "нп Бурукан",
        "нп Джана",
        "с. Неран",
        "с. Тором",
        "с. Тугур",
        "с. Удское",
        "с. Чумикан",
      ],
      school: [
        "МКОУ НОШ с. Неран",
        "МКОУ ООШ с. Тугур",
        "МКОУ ООШ с. Удское",
        "МКОУ СОШ с. Чумикан",
      ],
    },
    "16": {
      area: "Ульчский м.р-н",
      locality: [
        "с. Аннинские Минеральные Воды",
        "с. Белоглинка",
        "с. Богородское",
        "с. Большие Санники",
        "с. Булава",
        "п. Быстринск",
        "с. Воскресенское",
        "п. Де-Кастри",
        "с. Дуди",
        "с. Имени Максима Горького",
        "с. Калиновка",
        "с. Кальма",
        "с. Кизи",
        "с. Киселевка",
        "п. Ключевой",
        "с. Кольчем",
        "п. Мариинский Рейд",
        "с. Мариинское",
        "с. Монгол",
        "с. Нижняя Гавань",
        "с. Новотроицкое",
        "п. Решающий",
        "с. Савинское",
        "с. Солонцы",
        "с. Софийск",
        "с. Сусанино",
        "с. Тахта",
        "с. Тулинское",
        "п. Тыр",
        "с. Ухта",
        "п. Циммермановка",
        "с. Чильба",
      ],
      school: [
        "МБОУ школа — сад п. Решающий",
        "МБОУ НШДС с. Калиновка",
        "МБОУ НШДС с. Кальма",
        "МБОУ НШДС с. Ухта",
        "МБОУ ООШ с. Савинское",
        "МБОУ СОШ с. Мариинское",
        "МБОУ СОШ п. Быстринск",
        "МБОУ СОШ п. Тыр",
        "МБОУ СОШ с. Богородское",
        "МБОУ СОШ с. Большие Санники",
        "МБОУ СОШ с. Булава",
        "МБОУ СОШ п. Де-Кастри",
        "МБОУ СОШ с. Дуди",
        "МБОУ СОШ с. Киселёвка",
        "МБОУ СОШ с. Солонцы",
        "МБОУ СОШ с. Софийск",
        "МБОУ СОШ с. Сусанино",
        "МБОУ СОШ с. Тахта",
        "МБОУ СОШ п. Циммермановка",
      ],
    },
    "17": {
      area: "Хабаровский м.р-н",
      locality: [
        "с. 14 км Владивостокского шоссе",
        "с. 16 км Владивостокского шоссе",
        "п. 18 км",
        "п. 24 км",
        "п. 40 км Владивостокское шоссе",
        "с. Анастасьевка",
        "с. Благодатное",
        "с. Бычиха",
        "с. Виноградовка",
        "с. Воронежское-1",
        "с. Воронежское-2",
        "с. Воронежское-3",
        "с. Восточное",
        "с. Восход",
        "с. Вятское",
        "с. Галкино",
        "с. Гаровка-1",
        "с. Гаровка-2",
        "п. Догордон",
        "с. Дружба",
        "с. Елабуга",
        "с. Заозерное",
        "с. Иванковцы",
        "с. Ильинка",
        "с. Казакевичево",
        "с. Калинка",
        "с. Князе-Волконское",
        "с. Константиновка",
        "с. Корсаково-1",
        "с. Корсаково-2",
        "рп Корфовский",
        "с. Краснознаменка",
        "с. Краснореченское",
        "с. Красносельское",
        "с. Кукан",
        "с. Лесное",
        "с. Малиновка",
        "с. Малышево",
        "с. Матвеевка",
        "с. Мирное",
        "с. Мичуринское",
        "с. Нагорное",
        "с. Наумовка",
        "с. Некрасовка",
        "с. Новокаменка",
        "с. Новокуровка",
        "с. Новотроицкое",
        "с. Осиновая Речка",
        "с. Пасека",
        "с. Петропавловка",
        "п. Победа",
        "с. Ракитное",
        "с. Ровное",
        "с. Рощино",
        "с. Свечино",
        "с. Сергеевка",
        "с. Сикачи-Алян",
        "с. Скворцово",
        "с. Смирновка",
        "с. Сосновка",
        "с. Таежное",
        "с. Томское",
        "с. Тополево",
        "с. Улика-Национальное",
        "с. Улика-Павловка",
        "с. Федоровка",
        "Хабаровск-43 Городок",
        "Хабаровск-47 Городок",
        "с. Хаил",
        "п. Хехцир",
        "с. Челны",
        "с. Черная Речка",
        "с. Чернолесье",
        "п. Чирки",
        "с. Чистополье",
      ],
      school: [
        "Вечерняя школа с. Тополево",
        "МКОУ НОШ с. Федоровка",
        "МБОУ НШ ДС «Радуга» с. Краснореченское",
        "МКОУ НШ ДС с. Улика-Национальное",
        "МКОУ ООШ п. Догордон",
        "МБОУ ООШ с. Благодатное",
        "МБОУ ООШ с. Матвеевка",
        "МБОУ СОШ рп Корфовский",
        "МБОУ СОШ п. Кукан",
        "МБОУ СОШ п. Победа",
        "МБОУ СОШ с. Бычиха",
        "МБОУ СОШ с. Восточное",
        "МКОУ СОШ с. Вятское",
        "МБОУ СОШ с. Галкино",
        "МБОУ СОШ с. Гаровка-1",
        "МБОУ СОШ с. Дружба",
        "МБОУ СОШ с. Елабуга",
        "МБОУ СОШ с. Ильинка",
        "МБОУ СОШ с. Казакевичево",
        "МБОУ СОШ с. Калинка",
        "МБОУ СОШ с. Малышево",
        "МБОУ СОШ с. Мирное",
        "МБОУ СОШ с. Мичуринское",
        "МБОУ СОШ с. Новокуровка",
        "МБОУ СОШ с. Осиновая Речка",
        "МБОУ СОШ с. Ракитное",
        "МБОУ СОШ с. Сергеевка",
        "МКОУ СОШ с. Сикачи-Алян",
        "МКОУ СОШ с. Таёжное",
        "МБОУ СОШ с. Тополево",
        "МБОУ СОШ с. Корсаково-1",
        "МБОУ СОШ №1 с. Князе-Волконское",
        "МБОУ СОШ №1 с. Некрасовка",
        "МБОУ СОШ с. Гаровка-2",
        "МБОУ СОШ №2 с. Некрасовка",
        "МКОУ ВШ №12 с. Заозерное",
        "МКОУ СОШ №2 с. Князе-Волконское-1",
      ],
    },
    "18": {
      area: "г. Хабаровск",
      locality: ["г. Хабаровск"],
      school: [
        "МАОУ Военно-морской лицей",
        "МАОУ ЛИТ",
        "МБОУ лицей Вектор",
        "МАОУ лицей Звёздный",
        "МБОУ лицей РИТМ",
        "МАОУ лицей Ступени",
        "МАОУ Математический лицей",
        "МАОУ МПЛ",
        "МАОУ НОШ Открытие",
        "МАОУ НОШ Первые шаги",
        "МАОУ Политехнический лицей",
        "МАОУ СШ Успех",
        "МАОУ Экономическая гимназия",
        "МБОУ гимназия №1",
        "МБОУ кадетская школа №1",
        "МАОУ СОШ №1",
        "МБОУ СОШ №1 им. С.В.Орлова",
        "МБОУ СОШ №2 п. Березовка",
        "МАОУ гимназия №3",
        "МАОУ СШ №3",
        "МАОУ гимназия №4",
        "МБОУ гимназия №5",
        "МАОУ гимназия №6",
        "МБОУ СОШ №6",
        "МБОУ гимназия №7",
        "МБОУ гимназия №8",
        "МБОУ СОШ №9",
        "МАОУ СШ №10",
        "МБОУ Правовой лицей им. Сергея Никоненко",
        "МБОУ СОШ №12",
        "МАОУ СШ №13",
        "МБОУ НШ ДС №14",
        "МБОУ СОШ №15",
        "МБОУ СОШ №16",
        "МАОУ СШ №19",
        "МБОУ ВШ №22",
        "МБОУ СШ №23",
        "МБОУ СОШ №24",
        "МАОУ СШ №26",
        "МАОУ СШ №27",
        "МБОУ СОШ №29",
        "МБОУ СОШ №30",
        "МБОУ СОШ №32",
        "МАОУ СШ №33",
        "МАОУ СШ №35",
        "МАОУ Академический Лицей",
        "МБОУ СОШ №38",
        "МБОУ СОШ №39",
        "МАОУ СШ №40",
        "МБОУ СОШ №43",
        "МБОУ СОШ №44",
        "МБОУ СОШ №46",
        "МАОУ СШ №47",
        "МБОУ СШ №49",
        "МАОУ СШ №51",
        "МБОУ СОШ №52",
        "МБОУ СОШ №56",
        "МБОУ СОШ №58",
        "МБОУ СОШ №62",
        "МБОУ СОШ №63",
        "МАОУ СШ №66",
        "МБОУ СОШ №67",
        "МБОУ СОШ №68",
        "МБОУ СОШ №70",
        "МБОУ СОШ №72",
        "МБОУ СШ №76",
        "МАОУ СОШ №77",
        "МАОУ СШ с УИОП №80",
        "МБОУ СШ №83",
        "МБОУ СОШ №85",
        "МБОУ СОШ №87",
      ],
    },
    "19": {
      area: "г. Комсомольск-на-Амуре",
      locality: ["г. Комсомольск-на-Амуре"],
      school: [
        "МОУ Инженерная школа",
        "МОУ ЦО Открытие",
        "МОУ гимназия №1",
        "МБОУ лицей №1",
        "МОУ СОШ №3",
        "МОУ СОШ №4",
        "МОУ СОШ №5",
        "МОУ СОШ №6",
        "МОУ СОШ №7",
        "МОУ СОШ №8",
        "МОУ гимназия №9",
        "МОУ СОШ №13",
        "МОУ СОШ №14",
        "МОУ СОШ №15",
        "МОУ СОШ С УИОП №16",
        "МОУ СОШ №19",
        "МОУ СШ №22",
        "МОУ СОШ №23",
        "МОУ СОШ №24",
        "МОУ СОШ №27",
        "МОУ СОШ №28",
        "МОУ ООШ №29",
        "МОУ СОШ №30",
        "МОУ СОШ №31",
        "МОУ СОШ №32",
        "МОУ Лицей №33",
        "МОУ СОШ №34",
        "МОУ СОШ №35",
        "МОУ СОШ №36",
        "МОУ СОШ №37",
        "МОУ СОШ №38",
        "МОУ СОШ №42",
        "МОУ гимназия №45",
        "МОУ СОШ №50",
        "МОУ СОШ №51",
        "МОУ СОШ №53",
        "МОУ СОШ №62",
      ],
    },
  };
  const url = "/core/form_handler.php";
  const formAreaSelect = document.getElementById("area");
  const formLocalitySelect = document.getElementById("locality");
  const formSchoolSelect = document.getElementById("school");
  const formSchoolClassSelect = document.getElementById("school-class");
  const formFields = document.querySelectorAll(".form-field");
  const formTextField = document.querySelectorAll(".text-field");
  const formSelectField = document.querySelectorAll(".select-field");
  const formBtnSubmit = document.getElementById("button-submit");
  const formBtnReset = document.getElementById("button-reset");
  const message = document.querySelector(".message-wrap");
  const messageText = document.querySelector(".message-text");
  const formDataValue = [];

  //Создание выпадающего списка - Район проживания
  function createformAreaSelect() {
    for (const key in dataSelect) {
      let option = document.createElement("option");
      option.setAttribute("data", key);
      option.setAttribute("value", dataSelect[key]["area"]);
      option.textContent = dataSelect[key]["area"];
      formAreaSelect.append(option);
    }
  }
  createformAreaSelect();

  //Получение data-атрибута выпадающего списка(Район проживания) для создания выпадающих списков(Населенный пункт и Место учебы)
  function getAttrOptionAreaSelect() {
    let option = formAreaSelect.selectedOptions;
    let data = "";
    for (let i = 0; i < option.length; i++) {
      data = option[i].getAttribute("data");
    }
    return data;
  }

  //Создание выпадающего списка - Населенный пункт
  function createformLocalitySelect() {
    formLocalitySelect.length = 0;
    let option = document.createElement("option");
    option.setAttribute("value", "");
    option.setAttribute("selected", "");
    option.setAttribute("disabled", "");
    option.textContent = "Выберите населенный пункт";
    formLocalitySelect.append(option);
    let dataAttr = getAttrOptionAreaSelect();
    for (const key in dataSelect) {
      if (key == dataAttr) {
        for (let i = 0; i < dataSelect[key]["locality"].length; i++) {
          let option = document.createElement("option");
          option.setAttribute("value", dataSelect[key]["locality"][i]);
          option.textContent = dataSelect[key]["locality"][i];
          formLocalitySelect.append(option);
        }
      }
    }
  }
  createformLocalitySelect();

  //Создание выпадающего списка - Место учебы
  function createformSchoolSelect() {
    formSchoolSelect.length = 0;
    let option = document.createElement("option");
    option.setAttribute("value", "");
    option.setAttribute("selected", "");
    option.setAttribute("disabled", "");
    option.textContent = "Выберите место учебы";
    formSchoolSelect.append(option);
    let dataAttr = getAttrOptionAreaSelect();
    for (const key in dataSelect) {
      if (key == dataAttr) {
        for (let i = 0; i < dataSelect[key]["school"].length; i++) {
          let option = document.createElement("option");
          option.setAttribute("value", dataSelect[key]["school"][i]);
          option.textContent = dataSelect[key]["school"][i];
          formSchoolSelect.append(option);
        }
      }
    }
  }
  createformSchoolSelect();

  formAreaSelect.onchange = function () {
    createformLocalitySelect();
    createformSchoolSelect();
  };

  //Сброс выпадающего списка(Населенный пункт) до значения по умолчанию
  function resetformLocalitySelect() {
    formLocalitySelect.length = 0;
    let parent = formLocalitySelect.parentNode;
    let option = document.createElement("option");
    option.setAttribute("value", "");
    option.setAttribute("selected", "selected");
    option.setAttribute("selected", "selected");
    option.setAttribute("disabled", "disabled");
    option.textContent = "Выберите населенный пункт";
    formLocalitySelect.append(option);
    parent.classList.remove("valid");
  }

  //Сброс выпадающего списка(Место учебы) до значения по умолчанию
  function resetformSchoolSelect() {
    formSchoolSelect.length = 0;
    let parent = formSchoolSelect.parentNode;
    let option = document.createElement("option");
    option.setAttribute("value", "");
    option.setAttribute("selected", "selected");
    option.setAttribute("selected", "selected");
    option.setAttribute("disabled", "disabled");
    option.textContent = "Выберите место учебы";
    formSchoolSelect.append(option);
    parent.classList.remove("valid");
  }

  //Проверка выпадающих списков на пустое значение
  function checkEmptySelectField(event) {
    let item = event.target;
    let parent = item.parentNode;
    item.value = item.value.trim();
    if (item.value.length == 0) {
      parent.classList.add("invalid");
      parent.nextElementSibling.textContent = "Выберите один из вариантов";
    } else {
      parent.classList.add("valid");
    }
  }

  //Проверка вводимых данных поля Дата рождения на соответствие шаблону
  function checkValueDateOfBirth(event) {
    let item = event.target;
    let regexExpression = /^\d{2}\.\d{2}\.\d{4}$/g;
    item.value = item.value.trim();
    if (item.value.length == 0) {
      item.classList.add("invalid");
      item.nextElementSibling.textContent = "Заполните поле";
    } else if (item.value.length < 10) {
      item.value = "";
      item.classList.add("invalid");
      item.nextElementSibling.textContent = "Неверный формат данных";
    } else if (!regexExpression.test(item.value)) {
      item.value = "";
      item.classList.add("invalid");
      item.nextElementSibling.textContent =
        "Укажите дату рождения в формате дд.мм.гггг";
    } else {
      item.nextElementSibling.textContent = "";
      item.classList.add("valid");
    }
  }

  //Проверка на правильность(только цифры) вводимых данных поля Дата рождения
  function validationInputCharactersDateOfBirth(event) {
    let item = event.target;
    let regexExpression = /^[0-9\.]+$/;
    if (!regexExpression.test(item.value)) {
      item.value = item.value.replace(/[^0-9\.]/g, "");
      item.nextElementSibling.textContent = "Неверный формат данных";
      item.classList.add("invalid");
    } else {
      item.nextElementSibling.textContent = "";
      if (item.classList.contains("invalid")) {
        item.classList.remove("invalid");
      }
    }
  }

  //Проверка на правильность вводимых даннхы поля Социальный и семейный статус
  function checkValueStatusField(event) {
    let item = event.target;
    let regexExpression = /^[\?"а-яё\s\d\.\,\-\–\—\(\)\?"]+$/gi;
    itemValue = replaceLongSpace(item);
    if (!regexExpression.test(itemValue)) {
      item.value = itemValue.replace(/[^\?"а-яё\s\d\.\,\-\–\—\(\)\?"]+/gi, "");
      item.nextElementSibling.textContent = "Неверный формат данных";
      item.classList.add("invalid");
    } else {
      item.nextElementSibling.textContent = "";
      if (item.classList.contains("invalid")) {
        item.classList.remove("invalid");
      }
    }
  }

  //Проверка на правильность вводимых данных поля Направляющая строна
  function checkValuePetitionField(event) {
    let item = event.target;
    let regexExpression = /^[\?"а-яё\s\d\.\№\-\–\—\(\)\?"]+$/gi;
    itemValue = replaceLongSpace(item);
    if (!regexExpression.test(itemValue)) {
      item.value = itemValue.replace(/[^\?"а-яё\s\d\.\№\-\–\—\(\)\?"]/gi, "");
      item.nextElementSibling.textContent = "Неверный формат данных";
      item.classList.add("invalid");
    } else {
      item.nextElementSibling.textContent = "";
      if (item.classList.contains("invalid")) {
        item.classList.remove("invalid");
      }
    }
  }

  //Проверка всех текстовых полей формы на правильность вводимых данных
  function checkTextCharacter(event) {
    let item = event.target;
    let regexExpression = /^[а-яёА-ЯЁ\s]+$/;
    itemValue = replaceLongSpace(item);
    if (!regexExpression.test(itemValue)) {
      item.value = itemValue.replace(/[^а-яё\s]/gi, "");
      item.nextElementSibling.textContent = "Неверный формат данных";
      item.classList.add("invalid");
    } else {
      item.nextElementSibling.textContent = "";
      if (item.classList.contains("invalid")) {
        item.classList.remove("invalid");
      }
    }
  }

  //Проверка номера телефона на соотвествие шаблону
  function checkValueTelNumber(event) {
    let item = event.target;
    let regexExpression = /^(8)(9?\(?\d{1,5}\)?)(\s|\-)(\d{1,3})(\-\d{1,2})+$/;
    item.value = item.value.trim();
    if (item.value.length == 0) {
      item.nextElementSibling.textContent = "Заполните поле";
      item.classList.add("invalid");
    } else if (item.value.length < 14 || item.value.length > 16) {
      item.value = "";
      item.nextElementSibling.textContent =
        "Укажите телефон в формате 8999 123-45-67 или 8(4212) 12-34-56";
      item.classList.add("invalid");
    } else if (!regexExpression.test(item.value)) {
      item.value = "";
      item.nextElementSibling.textContent = "Неверный формат данных";
      item.classList.add("invalid");
    } else {
      item.nextElementSibling.textContent = "";
      item.classList.add("valid");
    }
  }

  //Проверка на правильность вводимых данных(только цифры) поля Номер телефона
  function validationInputCharactersTelNumber(event) {
    let item = event.target;
    let regexExpression = /^[0-9\s\-\(\)]+$/;
    if (!regexExpression.test(item.value)) {
      item.value = item.value.replace(/[^0-9\s\-\(\)]/g, "");
      item.nextElementSibling.textContent = "Неверный формат данных";
      item.classList.add("invalid");
    } else {
      item.nextElementSibling.textContent = "";
      if (item.classList.contains("invalid")) {
        item.classList.remove("invalid");
      }
    }
  }

  //Обработка данных, полученных от сервера
  function getResponseServer(response) {
    if (response.answer == "success") {
      createMessageSubmit(message, messageText, {
        borderColor: "#3E90B2",
        text: "Заявка успешно подана! Сообщение удалиться автоматически.",
      });
      clearFormTextField(formTextField);
      resetFormSelect(formAreaSelect);
      resetformLocalitySelect();
      resetformSchoolSelect();
      resetFormSelect(formSchoolClassSelect);
    } else {
      createMessageSubmit(message, messageText, {
        borderColor: "#B35060",
        text: "Что-то пошло не так. Обновите страницу и попробуйте еще раз.",
      });
    }
  }

  formTextField.forEach((elem) => {
    elem.addEventListener("focus", removeError);
    if (elem.name != "date-of-birth" && elem.name != "tel") {
      elem.addEventListener("blur", checkEmptyField);
    }
    if (elem.name == "full-name" || elem.name == "contact-person") {
      elem.addEventListener("input", checkTextCharacter);
    } else if (elem.name == "status") {
      elem.addEventListener("input", checkValueStatusField);
    } else if (elem.name == "petition") {
      elem.addEventListener("input", checkValuePetitionField);
    } else if (elem.name == "date-of-birth") {
      elem.addEventListener("blur", checkValueDateOfBirth);
      elem.addEventListener("input", validationInputCharactersDateOfBirth);
    } else if (elem.name == "tel") {
      elem.addEventListener("blur", checkValueTelNumber);
      elem.addEventListener("input", validationInputCharactersTelNumber);
    }
    elem.addEventListener("keydown", deleteLastCharacter);
  });

  formSelectField.forEach((elem) => {
    elem.addEventListener("focus", removeError);
    elem.addEventListener("change", checkEmptySelectField);
  });

  formBtnSubmit.onclick = function (event) {
    event.preventDefault();
    if (checkValueFieldsBeforeSubmit(formFields)) {
      getFormValue(formFields, formDataValue);
      sendAjaxQuery(url, "POST", getResponseServer, formDataValue);
    } else {
      return false;
    }
  };

  formBtnReset.onclick = function () {
    resetFormSelect(formAreaSelect);
    resetFormSelect(formSchoolClassSelect);
    resetformLocalitySelect();
    resetformSchoolSelect();
    clearFormTextField(formTextField);
  };
});
